Web Services/1. Webservice Testing/Transactions/findTransactions/Test Case 21/Apache_Output.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Body>
      <ns6:transactionList xmlns:ns12="http://www.hmco.com/EAI/OTS/EskerTransaction" xmlns:ns11="http://www.hmco.com/EAI/OTS/PackingList" xmlns:ns10="http://www.hmco.com/EAI/OTS/MaterialNew" xmlns:ns9="http://www.hmco.com/EAI/OTS/CustomerNew" xmlns:ns8="http://www.hmco.com/EAI/OTS/Material/GetATPNew" xmlns:ns7="http://www.hmco.com/EAI/OTS/Material/GetATP" xmlns:ns6="http://www.hmco.com/EAI/OTS/Transaction" xmlns:ns5="http://www.hmco.com/EAI/OTS/Order" xmlns:ns4="http://www.hmco.com/EAI" xmlns:ns3="http://www.hmco.com/EAI/OTS/Material" xmlns:ns2="http://www.hmco.com/EAI/OTS/Customer" xmlns="http://www.hmco.com/EAI/OTS/TransactionNew">
         <ns6:transaction>
            <ns6:transactionID>0000665816</ns6:transactionID>
            <ns6:type>TRANSACTION_TYPE_STANDARD</ns6:type>
            <ns6:poNumber>3041</ns6:poNumber>
            <ns6:status>TRANSACTION_STATUS_COMPLETELY_PROCESSED</ns6:status>
            <ns6:creationDate>2007-03-05</ns6:creationDate>
            <ns6:orderSource>ORDER_SOURCE_FAX</ns6:orderSource>
            <ns6:division>DIVISION_GREAT_SOURCE</ns6:division>
            <ns6:salesOffice/>
            <ns6:customerEmail>INFO@DONJOHNSTON.CO.UK</ns6:customerEmail>
            <ns6:soldToCustomerID>0000100021</ns6:soldToCustomerID>
            <ns6:soldToSANNumber/>
            <ns6:soldToCustomerName>DON JOHNSTON SPECIAL NEEDS LTD</ns6:soldToCustomerName>
            <ns6:soldToCustomerAddress>
               <ns2:addressLine1>18/19 CLARENDON COURT</ns2:addressLine1>
               <ns2:addressLine2>18/19 CLARENDON COURT</ns2:addressLine2>
               <ns2:poBox/>
               <ns2:city>WARRINGTON</ns2:city>
               <ns2:state>WT</ns2:state>
               <ns2:zipcode/>
               <ns2:countryCode>GB</ns2:countryCode>
               <ns2:emailAddressStruct>
                  <ns2:emailAddress>INFO@DONJOHNSTON.CO.UK</ns2:emailAddress>
                  <ns2:isPrimary>true</ns2:isPrimary>
               </ns2:emailAddressStruct>
               <ns2:emailAddressStruct>
                  <ns2:emailAddress>Andy@inclusive.co.uk</ns2:emailAddress>
                  <ns2:isPrimary>true</ns2:isPrimary>
               </ns2:emailAddressStruct>
            </ns6:soldToCustomerAddress>
            <ns6:soldToCustomerEmailAddress>INFO@DONJOHNSTON.CO.UK</ns6:soldToCustomerEmailAddress>
            <ns6:shipToCustomerID>0000100021</ns6:shipToCustomerID>
            <ns6:shipToSANNumber/>
            <ns6:shipToCustomerName>DON JOHNSTON SPECIAL NEEDS LTD</ns6:shipToCustomerName>
            <ns6:shipToCustomerAddress>
               <ns2:addressLine1>18/19 CLARENDON COURT</ns2:addressLine1>
               <ns2:addressLine2>18/19 CLARENDON COURT</ns2:addressLine2>
               <ns2:poBox/>
               <ns2:city>WARRINGTON</ns2:city>
               <ns2:state>WT</ns2:state>
               <ns2:zipcode/>
               <ns2:countryCode>GB</ns2:countryCode>
               <ns2:emailAddressStruct>
                  <ns2:emailAddress>INFO@DONJOHNSTON.CO.UK</ns2:emailAddress>
                  <ns2:isPrimary>true</ns2:isPrimary>
               </ns2:emailAddressStruct>
               <ns2:emailAddressStruct>
                  <ns2:emailAddress>Andy@inclusive.co.uk</ns2:emailAddress>
                  <ns2:isPrimary>true</ns2:isPrimary>
               </ns2:emailAddressStruct>
            </ns6:shipToCustomerAddress>
            <ns6:shipToCustomerEmailAddress>INFO@DONJOHNSTON.CO.UK</ns6:shipToCustomerEmailAddress>
            <ns6:billToCustomerID>0000100021</ns6:billToCustomerID>
            <ns6:billToSANNumber/>
            <ns6:billToCustomerName>DON JOHNSTON SPECIAL NEEDS LTD</ns6:billToCustomerName>
            <ns6:billToCustomerAddress>
               <ns2:addressLine1>18/19 CLARENDON COURT</ns2:addressLine1>
               <ns2:addressLine2>18/19 CLARENDON COURT</ns2:addressLine2>
               <ns2:poBox/>
               <ns2:city>WARRINGTON</ns2:city>
               <ns2:state>WT</ns2:state>
               <ns2:zipcode/>
               <ns2:countryCode>GB</ns2:countryCode>
               <ns2:emailAddressStruct>
                  <ns2:emailAddress>INFO@DONJOHNSTON.CO.UK</ns2:emailAddress>
                  <ns2:isPrimary>true</ns2:isPrimary>
               </ns2:emailAddressStruct>
               <ns2:emailAddressStruct>
                  <ns2:emailAddress>Andy@inclusive.co.uk</ns2:emailAddress>
                  <ns2:isPrimary>true</ns2:isPrimary>
               </ns2:emailAddressStruct>
            </ns6:billToCustomerAddress>
            <ns6:billToCustomerEmailAddress>INFO@DONJOHNSTON.CO.UK</ns6:billToCustomerEmailAddress>
            <ns6:isHeaderComplete>true</ns6:isHeaderComplete>
            <ns6:transactionRejectionStatus>TRANSACTION_REJECTION_STATUS_NOT_REJECTED</ns6:transactionRejectionStatus>
            <ns6:transactionLineItem>
               <ns6:productInfo>
                  <ns6:lineNo>10</ns6:lineNo>
                  <ns6:materialID>000000000000052682</ns6:materialID>
                  <ns6:isbn>9780669526820</ns6:isbn>
                  <ns6:description>EAROBICS ADOL/ADULT CLINIC</ns6:description>
                  <ns6:couponCode/>
                  <ns6:promotionType/>
                  <ns6:quantity>10</ns6:quantity>
                  <ns6:listPrice>2990.0</ns6:listPrice>
                  <ns6:netPrice>1704.0</ns6:netPrice>
                  <ns6:productDivision>DIVISION_RIVERDEEP</ns6:productDivision>
                  <ns6:listDiscount>1286.0</ns6:listDiscount>
                  <ns6:isEGood>false</ns6:isEGood>
                  <ns6:isSubscription>false</ns6:isSubscription>
               </ns6:productInfo>
               <ns6:lineitemStatus>LINE_ITEM_STATUS_COMPLETELY_PROCESSED</ns6:lineitemStatus>
               <ns6:lineitemRejectionStatus>LINE_ITEM_REJECTION_STATUS_NOT_REJECTED</ns6:lineitemRejectionStatus>
               <ns6:isLineitemComplete>true</ns6:isLineitemComplete>
               <ns6:titleStatus>MATERIAL_STATUS_IN_PRINT</ns6:titleStatus>
               <ns6:deliveryBlock>DELIVERY_BLOCK_UNEXPECTED</ns6:deliveryBlock>
               <ns6:requestDate>2007-03-05</ns6:requestDate>
               <ns6:availableDate>2007-03-16</ns6:availableDate>
               <ns6:salesRep>
                  <ns6:repID>0000020072</ns6:repID>
                  <ns6:repName>INACTIVE 55-388</ns6:repName>
                  <ns6:sfaRepID>550000</ns6:sfaRepID>
               </ns6:salesRep>
               <ns6:itemType>ITEM_TYPE_SALE</ns6:itemType>
               <ns6:isKitComponent>false</ns6:isKitComponent>
            </ns6:transactionLineItem>
            <ns6:shipToCareOf_1/>
            <ns6:shipToCareOf_2/>
            <ns6:billingBlock>BILLING_BLOCK_UNEXPECTED</ns6:billingBlock>
         </ns6:transaction>
      </ns6:transactionList>
   </soap:Body>
</soap:Envelope>